app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."user_id" = $1  [["user_id", 32]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def fetch_orders
    @user = User.find(params[:id])
    new_file_path = Rails.root.join('public', 'orders', "user_#{user_id}_orders.csv")

    # should be moved to a sidekiq job in the future.
    CSV.open(new_file_path, "wb") do |csv|
      csv << ["USERNAME", "USER_EMAIL", "PRODUCT_CODE", "PRODUCT_NAME", "PRODUCT_CATEGORY", "ORDER_DATE"]
      @user.order_details.each do |order|
        csv << [@user.user_name, @user.email, order.product.code, order.product.name, order.product.category, order.order_date]